# brew のインストール
# Xcode Commandline Tools いれる
# ruby -e "$(curl -fsSL https://raw.github.com/mxcl/homebrew/go)"
# brew install args を生成

# ack, better than grep
# the_silver_searcher, better than ack
# command, ag
the_silver_searcher
# make あたりで必要
autoconf
# make あたりで必要
automake
# bash 最新版
bash
# bash 便利補完
bash-completion
# vim でタグ補完するとき
# Mac標準はだめっぽい
ctags
# フォント。blockdiag でつかった
freetype2
# zsh あたりで必要
gdbm
# はい
# gitのデフォルト設定
# git config --global user.name "altnight";
# git config --global user.email altnightsight@gmail.com;
# git config --global core.editor 'vim -c "set fenc=utf-8"';
# git config --global color.ui auto
# git config --global alias.st status
# git config --global alias.ci commit
# git config --global alias.co checkout
# git config --global alias.d diff
# git config --global push.default simple
git
# 標準の sed が BSD のため
# gsed で使う
gnu-sed
# top のいい感じ版
htop-osx
# 非同期ライブラリ
# tmuxで必要
libevent
# hg
mercurial
# zsh あたりで必要
pcre
# Emac like に動く
readline
# 対話環境で Emacs like にうごくラッパー
rlwrap
# いちおう
sqlite
# git の CUI 履歴ツール
tig
# session
tmux
# show tree
tree
# huge で +python +clipboard などある
vim
# いちおう
wget
# はい
# chsh -s /usr/local/bin/zsh しましょう
zsh
# Mac で BSD 系処理を GNU 系処理にするっぽい
coreutils
# pkill vim などでプロセスを kill
proctools

# zsh general
# mkdir -p ~/.zsh;
#
# zsh autojump
#
# cd ~/.zsh;
# git clone git://github.com/joelthelion/autojump.git;
# cd ~/.zsh/autojump;
# # for Mac
# sudo mkdir -p /etc/profile.d;
# sudo ./install.sh --zsh;
# sudo cp ~/autojump/bin/_j /usr/local/share/zsh/site-functions/;
# cd;
#
# zsh mysql
#
# cd ~/.zsh;
# git clone git://github.com/tetsujin/zsh-function-mysql.git;
# mkdir -p ~/.zsh/functions;
# ln -s ~/.zsh/zsh-function-mysql/mysql ~/.zsh/functions;
